# include<iostream>
using namespace std;

int main0() {

	//代码流程
	//接下来将管理系统这个文件称为主文件
	//1.创建 workerManager 头文件和cpp文件
	//2.在workerManager头文件里创建workerManager构造函数和析构函数
	//3.在cpp文件中将构造和析构函数空实现补全
	//4.在头文件里添加展示菜单的接口
	//5.在cpp文件里将展示菜单里的内容填写
	//6.在主文件里开始调用之前设计的程序接口
	// 先实例化  然后调用展示菜单成员函数
	// 7.主程序测试
	// 8.设置用户输入功能
	// 9.在头文件里设置退出系统的接口
	// 10.创建一个职工抽象类的头文件   worker.h
	// 11.创建员工的类  employee.h  和cpp文件
	// 12.这里在测试的时候出现了一个错误,就是不允许使用抽象类类型,
	// 原因是.h文件里打错了一个字  导致多态没有继承正确
	// 
	// 13.复制并修改经理类和老板类 相同步骤创建头文件和cpp文件
	// 
	// 14,创建了一个专门测试的文件来测试写的内容   
	// 这个要养成习惯
	// 
	// 15.在workerManager.h文件中添加记录职工人数和职工数组指针
	// 
	// 16.在cpp文件中初始化这两个属性
	// 
	// 17.在workerManager.h头文件中增加添加职工的函数
	// 18.在cpp文件中实现
	// 
	// 19.在实现增加员工的过程中,特别容易出现缩进错误,会直接导致程序出BUG
	// 
	// 20. 创建保存文件save函数接口   然后自定义文件名  
	// 
	// 21.在头文件中添加标志   判断文件是否为空
	// 然后在cpp文件中修改初始化属性这里重新修改一下
	// 
	// 22.在头文件中添加统计人数接口
	// 
	// 23.在头文件中添加初始化员工的接口
	// 
	// 24.在头文件中添加显示职工的接口
	// 
	// 25.在头文件中添加删除职工的接口
	// 
	// 26.在头文件中添加判断职工是否存在的接口
	// 
	// 27.在头文件中添加修改职工的接口
	// 
	//




	system("pause");

	return 0;

}